1s/ERP/Conf/Catalogs/Лико_ВидыДопРасходовНаПоступлениеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ВидыДопРасходовНаПоступлениеМатериалов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДопРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДопРасход</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ДопРасходыНаПоступлениеМатериалов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ВидыДопРасходовНаПоступлениеМатериалов/Ext/ManagerModule.bsl
Функция РасходыПоВиду(Организация,ВидРасхрда) Экспорт  //+Лико m.shenderov 12.02.2024
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лико_ВидыДопРасходовНаПоступлениеМатериаловОрганизации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВтРасходыПоОрганизации
	|ИЗ
	|	Справочник.Лико_ВидыДопРасходовНаПоступлениеМатериалов.Организации КАК Лико_ВидыДопРасходовНаПоступлениеМатериаловОрганизации
	|ГДЕ
	|	Лико_ВидыДопРасходовНаПоступлениеМатериаловОрганизации.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ВидыДопРасходовНаПоступлениеМатериаловДопРасходы.Валюта КАК Валюта,
	|	Лико_ВидыДопРасходовНаПоступлениеМатериаловДопРасходы.ДопРасход КАК Расход,
	|	Лико_ВидыДопРасходовНаПоступлениеМатериаловДопРасходы.Сумма КАК Сумма,
	|	Лико_ВидыДопРасходовНаПоступлениеМатериаловДопРасходы.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВтРасходыПоОрганизации КАК ВтРасходыПоОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лико_ВидыДопРасходовНаПоступлениеМатериалов.ДопРасходы КАК Лико_ВидыДопРасходовНаПоступлениеМатериаловДопРасходы
	|		ПО ВтРасходыПоОрганизации.Ссылка = Лико_ВидыДопРасходовНаПоступлениеМатериаловДопРасходы.Ссылка
	|ГДЕ
	|	Лико_ВидыДопРасходовНаПоступлениеМатериаловДопРасходы.Ссылка = &ВидРасхрда
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Организация",Организация );
	Запрос.УстановитьПараметр("ВидРасхрда",ВидРасхрда );
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
	
	
КонецФункции //-Лико m.shenderov 12.02.2024
